/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   terminal.h                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fcodi <fcodi@student.42.fr>                +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/24 20:48:58 by fcodi             #+#    #+#             */
/*   Updated: 2020/11/24 20:49:05 by fcodi            ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef TERMINAL_H
# define TERMINAL_H

/*
** TODO Рассматреть возможность изменения начального размера окна терминала
** во время компиляции и (возможно) посредством флага(ов)
*/

# ifndef TERMINAL_COLS
#  define TERMINAL_COLS 80
# endif
# ifndef TERMINAL_ROWS
#  define TERMINAL_ROWS 25
# endif

#endif
